source ~/dotfiles/.zshrc
source ~/dotfiles/.zshrc.docker.zshrc
source ~/.zshrc.userown.zshrc

# --------------------------------------------------------------------------------
# 各パッケージマネージャでインストールされるツール（バージョン管理ツール含む）
# --------------------------------------------------------------------------------
# mise (https://mise.jdx.dev/)
# cargo でインストールされる
# バッティングするバージョン管理ツールがある場合は順番依存になるので注意すること
eval "$(mise activate zsh)"

# fnm (https://github.com/Schniz/fnm)
# cargo でインストールされる
eval "$(fnm env --use-on-cd --shell zsh)"

# Starship
eval "$(starship init zsh)"
# --------------------------------------------------------------------------------

# --------------------------------------------------------------------------------
# CLI
# --------------------------------------------------------------------------------
# zoxide (https://github.com/ajeetdsouza/zoxide)
eval "$(zoxide init zsh)"
export _ZO_FZF_OPTS="--preview=''"
# --------------------------------------------------------------------------------


# --------------------------------------------------------------------------------
# 以下、自動生成の追記のみとし、手動では書き込まない
# 二重で読み込んでいるものは適宜削除する
# --------------------------------------------------------------------------------
